#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//操作符
//算术操作符：+ - * /(整数相除只能得到整数商，想要得到小数需要有一个数为小数)  
//移位操作符：>>(向右移  <<（向左移   移动的是二进制位
//位操作符：& 按位与 |按位或 ^按位异或
//有俩操作符叫双目操作符
//单目操作符：只有一个操作符 - 

//sizeof 计算类型或者变量的大小  sizeof(int)  sizeof a

//0 表示假 ！0表示真



int main()
{
	//int a = 9 % 2;//取余（模）

	//printf("%d\n", a);

	//int a = 2;
	//int b = a << 1;//32个字节 - 2 - 00000000 00000000 00000000 00000010 - 向左移动两位 - 00000000 00000000 00000000 00001000 - 4

	//printf("%d\n", b);

	int a = 2;
	int b = a + 5;
	a += 5;

	printf("%d\n", a);

	return 0;
}